docs/examples/Rate_v22/Rate  Intra India COD_Request_Reply.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://fedex.com/ws/rate/v22">
   <SOAP-ENV:Body>
      <RateRequest>
         <WebAuthenticationDetail>
            <ParentCredential>
               <Key>Input Your Information</Key>
               <Password>Input Your Information</Password>
            </ParentCredential>
            <UserCredential>
               <Key>Input Your Information</Key>
               <Password>Input Your Information</Password>
            </UserCredential>
         </WebAuthenticationDetail>
         <ClientDetail>
            <AccountNumber>Input Your Information</AccountNumber>
            <MeterNumber>Input Your Information</MeterNumber>
         </ClientDetail>
         <TransactionDetail>
            <CustomerTransactionId>FTC</CustomerTransactionId>
         </TransactionDetail>
         <Version>
            <ServiceId>crs</ServiceId>
            <Major>22</Major>
            <Intermediate>0</Intermediate>
            <Minor>0</Minor>
         </Version>
         <RequestedShipment>
            <ShipTimestamp>2016-12-13T12:34:56-06:00</ShipTimestamp>
            <DropoffType>REGULAR_PICKUP</DropoffType>
            <ServiceType>STANDARD_OVERNIGHT</ServiceType>
            <PackagingType>YOUR_PACKAGING</PackagingType>
            <PreferredCurrency>INR</PreferredCurrency>
            <Shipper>
               <Contact>
                  <PersonName>Input Your Information</PersonName>
                  <CompanyName>Input Your Information</CompanyName>
                  <PhoneNumber>Input Your Information</PhoneNumber>
                  <EMailAddress>sender@yahoo.com</EMailAddress>
               </Contact>
               <Address>
                  <StreetLines>Input Your Information</StreetLines>
                  <StreetLines>Input Your Information</StreetLines>
                  <City>JAIPUR</City>
                  <StateOrProvinceCode>RJ</StateOrProvinceCode>
                  <PostalCode>302011</PostalCode>
                  <CountryCode>IN</CountryCode>
               </Address>
            </Shipper>
            <Recipient>
               <Contact>
                  <PersonName>Input Your Information</PersonName>
                  <CompanyName>Input Your Information</CompanyName>
                  <PhoneNumber>Input Your Information</PhoneNumber>
                  <EMailAddress>recipient@yahoo.com</EMailAddress>
               </Contact>
               <Address>
                  <StreetLines>Input Your Information</StreetLines>
                  <StreetLines>Input Your Information</StreetLines>
                  <City>NOIDA</City>
                  <StateOrProvinceCode>UP</StateOrProvinceCode>
                  <PostalCode>201306</PostalCode>
                  <CountryCode>IN</CountryCode>
               </Address>
            </Recipient>
            <ShippingChargesPayment>
               <PaymentType>SENDER</PaymentType>
            </ShippingChargesPayment>
            <SpecialServicesRequested>
               <SpecialServiceTypes>COD</SpecialServiceTypes>
               <CodDetail>
                  <CodCollectionAmount>
                     <Currency>USD</Currency>
                     <Amount>500</Amount>
                  </CodCollectionAmount>
                  <AddTransportationChargesDetail>
                     <RateTypeBasis>ACCOUNT</RateTypeBasis>
                     <ChargeBasis>COD_SURCHARGE</ChargeBasis>
                     <ChargeBasisLevel>CURRENT_PACKAGE</ChargeBasisLevel>
                  </AddTransportationChargesDetail>
                  <CollectionType>ANY</CollectionType>
               </CodDetail>
            </SpecialServicesRequested>
            <CustomsClearanceDetail>
               <DocumentContent>DOCUMENTS_ONLY</DocumentContent>
               <CustomsValue>
                  <Currency>INR</Currency>
                  <Amount>100.00</Amount>
               </CustomsValue>
               <CommercialInvoice>
                  <Purpose>SOLD</Purpose>
                  <TermsOfSale>FOB_OR_FCA</TermsOfSale>
               </CommercialInvoice>
               <Commodities>
                  <NumberOfPieces>1</NumberOfPieces>
                  <Description>ABCD</Description>
                  <CountryOfManufacture>IN</CountryOfManufacture>
                  <Weight>
                     <Units>LB</Units>
                     <Value>1.0</Value>
                  </Weight>
                  <Quantity>1</Quantity>
                  <QuantityUnits>cm</QuantityUnits>
                  <UnitPrice>
                     <Currency>INR</Currency>
                     <Amount>1.000000</Amount>
                  </UnitPrice>
                  <CustomsValue>
                     <Currency>INR</Currency>
                     <Amount>100.000000</Amount>
                  </CustomsValue>
               </Commodities>
               <ExportDetail>
                  <ExportComplianceStatement>30.37(f)</ExportComplianceStatement>
               </ExportDetail>
            </CustomsClearanceDetail>
            <RateRequestTypes>LIST</RateRequestTypes>
            <PackageCount>1</PackageCount>
            <RequestedPackageLineItems>
               <SequenceNumber>1</SequenceNumber>
               <GroupNumber>1</GroupNumber>
               <GroupPackageCount>1</GroupPackageCount>
               <Weight>
                  <Units>LB</Units>
                  <Value>20.0</Value>
               </Weight>
               <Dimensions>
                  <Length>12</Length>
                  <Width>12</Width>
                  <Height>12</Height>
                  <Units>IN</Units>
               </Dimensions>
               <CustomerReferences>
                  <CustomerReferenceType>CUSTOMER_REFERENCE</CustomerReferenceType>
                  <Value>TC001_01_PT1_ST01_PK01_SNDUS_RCPCA_POS</Value>
               </CustomerReferences>
            </RequestedPackageLineItems>
         </RequestedShipment>
      </RateRequest>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>


<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><RateReply xmlns="http://fedex.com/ws/rate/v22"><HighestSeverity>SUCCESS</HighestSeverity><Notifications><Severity>SUCCESS</Severity><Source>crs</Source><Code>0</Code><Message>Request was successfully processed. </Message><LocalizedMessage>Request was successfully processed. </LocalizedMessage></Notifications><TransactionDetail><CustomerTransactionId>FTC</CustomerTransactionId></TransactionDetail><Version><ServiceId>crs</ServiceId><Major>22</Major><Intermediate>0</Intermediate><Minor>0</Minor></Version><RateReplyDetails><ServiceType>STANDARD_OVERNIGHT</ServiceType><PackagingType>YOUR_PACKAGING</PackagingType><DestinationAirportId>DEL</DestinationAirportId><IneligibleForMoneyBackGuarantee>false</IneligibleForMoneyBackGuarantee><OriginServiceArea>AA</OriginServiceArea><DestinationServiceArea>AA</DestinationServiceArea><SignatureOption>SERVICE_DEFAULT</SignatureOption><ActualRateType>PAYOR_ACCOUNT_SHIPMENT</ActualRateType><RatedShipmentDetails><EffectiveNetDiscount><Currency>USD</Currency><Amount>3.64</Amount></EffectiveNetDiscount><AdjustedCodCollectionAmount><Currency>USD</Currency><Amount>502.48</Amount></AdjustedCodCollectionAmount><ShipmentRateDetail><RateType>PAYOR_ACCOUNT_SHIPMENT</RateType><RateScale>0000000</RateScale><RateZone>R0002</RateZone><PricingCode>HUNDREDWEIGHT</PricingCode><RatedWeightMethod>ACTUAL</RatedWeightMethod><CurrencyExchangeRate><FromCurrency>INR</FromCurrency><IntoCurrency>USD</IntoCurrency><Rate>0.02</Rate></CurrencyExchangeRate><DimDivisor>139</DimDivisor><DimDivisorType>COUNTRY</DimDivisorType><FuelSurchargePercent>22.5</FuelSurchargePercent><TotalBillingWeight><Units>LB</Units><Value>22.0</Value></TotalBillingWeight><TotalBaseCharge><Currency>USD</Currency><Amount>10.53</Amount></TotalBaseCharge><TotalFreightDiscounts><Currency>USD</Currency><Amount>1.26</Amount></TotalFreightDiscounts><TotalNetFreight><Currency>USD</Currency><Amount>9.27</Amount></TotalNetFreight><TotalSurcharges><Currency>USD</Currency><Amount>7.2</Amount></TotalSurcharges><TotalNetFedExCharge><Currency>USD</Currency><Amount>16.47</Amount></TotalNetFedExCharge><TotalTaxes><Currency>USD</Currency><Amount>2.28</Amount></TotalTaxes><TotalNetCharge><Currency>USD</Currency><Amount>18.75</Amount></TotalNetCharge><TotalRebates><Currency>USD</Currency><Amount>0.0</Amount></TotalRebates><TotalDutiesAndTaxes><Currency>USD</Currency><Amount>0.0</Amount></TotalDutiesAndTaxes><TotalAncillaryFeesAndTaxes><Currency>USD</Currency><Amount>0.0</Amount></TotalAncillaryFeesAndTaxes><TotalDutiesTaxesAndFees><Currency>USD</Currency><Amount>0.0</Amount></TotalDutiesTaxesAndFees><TotalNetChargeWithDutiesAndTaxes><Currency>USD</Currency><Amount>18.75</Amount></TotalNetChargeWithDutiesAndTaxes><FreightDiscounts><RateDiscountType>EARNED</RateDiscountType><Description>Grace</Description><Amount><Currency>USD</Currency><Amount>1.26</Amount></Amount><Percent>12.0</Percent></FreightDiscounts><FreightDiscounts><RateDiscountType>OTHER</RateDiscountType><Description>Other</Description><Amount><Currency>USD</Currency><Amount>0.0</Amount></Amount><Percent>0.0</Percent></FreightDiscounts><Surcharges><SurchargeType>COD</SurchargeType><Description>Payment on delivery</Description><Amount><Currency>USD</Currency><Amount>2.48</Amount></Amount></Surcharges><Surcharges><SurchargeType>FEDEX_INTRACOUNTRY_FEES</SurchargeType><Description>Waybill</Description><Amount><Currency>USD</Currency><Amount>2.48</Amount></Amount></Surcharges><Surcharges><SurchargeType>FUEL</SurchargeType><Description>Fuel</Description><Amount><Currency>USD</Currency><Amount>2.08</Amount></Amount></Surcharges><Surcharges><SurchargeType>OTHER</SurchargeType><Amount><Currency>USD</Currency><Amount>0.08</Amount></Amount></Surcharges><Taxes><TaxType>INTRACOUNTRY</TaxType><Description>India Service Tax</Description><Amount><Currency>USD</Currency><Amount>2.28</Amount></Amount></Taxes></ShipmentRateDetail></RatedShipmentDetails><RatedShipmentDetails><AdjustedCodCollectionAmount><Currency>USD</Currency><Amount>502.48</Amount></AdjustedCodCollectionAmount><ShipmentRateDetail><RateType>PAYOR_LIST_SHIPMENT</RateType><RateScale>0000000</RateScale><RateZone>R0002</RateZone><PricingCode>HUNDREDWEIGHT</PricingCode><RatedWeightMethod>ACTUAL</RatedWeightMethod><CurrencyExchangeRate><FromCurrency>INR</FromCurrency><IntoCurrency>USD</IntoCurrency><Rate>0.02</Rate></CurrencyExchangeRate><DimDivisor>139</DimDivisor><DimDivisorType>COUNTRY</DimDivisorType><FuelSurchargePercent>38.0</FuelSurchargePercent><TotalBillingWeight><Units>LB</Units><Value>22.0</Value></TotalBillingWeight><TotalBaseCharge><Currency>USD</Currency><Amount>10.53</Amount></TotalBaseCharge><TotalFreightDiscounts><Currency>USD</Currency><Amount>0.0</Amount></TotalFreightDiscounts><TotalNetFreight><Currency>USD</Currency><Amount>10.53</Amount></TotalNetFreight><TotalSurcharges><Currency>USD</Currency><Amount>9.14</Amount></TotalSurcharges><TotalNetFedExCharge><Currency>USD</Currency><Amount>19.67</Amount></TotalNetFedExCharge><TotalTaxes><Currency>USD</Currency><Amount>2.72</Amount></TotalTaxes><TotalNetCharge><Currency>USD</Currency><Amount>22.39</Amount></TotalNetCharge><TotalRebates><Currency>USD</Currency><Amount>0.0</Amount></TotalRebates><TotalDutiesAndTaxes><Currency>USD</Currency><Amount>0.0</Amount></TotalDutiesAndTaxes><TotalAncillaryFeesAndTaxes><Currency>USD</Currency><Amount>0.0</Amount></TotalAncillaryFeesAndTaxes><TotalDutiesTaxesAndFees><Currency>USD</Currency><Amount>0.0</Amount></TotalDutiesTaxesAndFees><TotalNetChargeWithDutiesAndTaxes><Currency>USD</Currency><Amount>22.39</Amount></TotalNetChargeWithDutiesAndTaxes><Surcharges><SurchargeType>COD</SurchargeType><Description>Payment on delivery</Description><Amount><Currency>USD</Currency><Amount>2.48</Amount></Amount></Surcharges><Surcharges><SurchargeType>FEDEX_INTRACOUNTRY_FEES</SurchargeType><Description>Waybill</Description><Amount><Currency>USD</Currency><Amount>2.48</Amount></Amount></Surcharges><Surcharges><SurchargeType>FUEL</SurchargeType><Description>Fuel</Description><Amount><Currency>USD</Currency><Amount>4.0</Amount></Amount></Surcharges><Surcharges><SurchargeType>OTHER</SurchargeType><Amount><Currency>USD</Currency><Amount>0.09</Amount></Amount></Surcharges><Taxes><TaxType>INTRACOUNTRY</TaxType><Description>India Service Tax</Description><Amount><Currency>USD</Currency><Amount>2.72</Amount></Amount></Taxes></ShipmentRateDetail></RatedShipmentDetails></RateReplyDetails></RateReply></SOAP-ENV:Body></SOAP-ENV:Envelope>